Repository: 84000/data-translation-memory
Catalog: toh174-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་འཇིག་རྟེན་འཛིན་གྱིས་ཡོངས་སུ་དྲིས་པ་ཞེས་བྱ་བའི་མདོ།
en: The Noble Sūtra The Inquiry of Lokadhara

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་བྱ་ཀ་ལན་ད་ཀའི་གནས་འོད་མའི་ཚལ་ན། དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །
en: The Blessed One was staying at the Kalandaka­nivāpa in Veṇuvana near Rājagṛha, with a great saṅgha of monks.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་འཁོར་མང་པོ་བརྒྱ་སྟོང་སྙེད་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་ལ་ཆོས་སྟོན་ཏེ།
en: The Blessed One was teaching the Dharma to a large assembly with hundreds of thousands of beings in attendance.

source: འཁོར་དེའི་ནང་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཇིག་རྟེན་འཛིན་ཅེས་བྱ་བའང་འདུས་པར་གྱུར་ཏེ།
en: Present in the assembly was the bodhisattva great being Lokadhara.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས། ཚད་མེད་པའི་ཡོན་ཏན་གྱིས་ཡོངས་སུ་བརྒྱན་པས་སེམས་བསྐྱེད་པའི་ཕྱིར།
en: It was his wish that bodhisattva great beings develop the mind of awakening by adorning themselves with immeasurable virtues;

source: ཆོས་ཐམས་ཅད་ཀྱི་ངེས་པའི་དོན་མཐར་ཕྱིན་པ་ཐམས་ཅད་ཤེས་པར་བྱ་བའི་ཕྱིར་
en: that they understand in its entirety the true meaning of all phenomena;

source: ཚད་མེད་པའི་སྨོན་པས་ཚད་མེད་པའི་རྒྱན་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ཤིན་ཏུ་ཤེས་པར་བྱ་བའི་ཕྱིར་
en: that they understand how limitless aspirations lead to the perfection of limitless ornaments;

source: ཚད་མེད་པའི་ཆོས་རྣམས་ཀྱི་ངེས་པའི་མཚན་ཉིད་རྟོགས་ཤིང་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར།
en: that they comprehend and understand the true characteristics of limitless phenomena;

source: སྨོན་ལམ་ཚད་མེད་པས་ལྷག་པའི་བསམ་པ་ཤིན་ཏུ་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར། ཡོངས་སུ་རྫོགས་པར་ཤེས་པའི་ཕྱིར།
en: that they purify their motivation through limitless aspirations; that they gain comprehensive knowledge;

source: སྦྱིན་པའི་རྒྱན་དང་། ངེས་པའི་རྣམ་པར་དག་པའི་ཕྱིར། ཚུལ་ཁྲིམས་ཀྱི་རྒྱན་དང་། བཟོད་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར། མཉེན་ཅིང་དེས་པའི་སེམས་དང་། རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར། བརྩོན་འགྲུས་དང་། ཡོངས་སུ་དག་པ་ཤེས་པར་བྱ་བའི་ཕྱིར། བསམ་གཏན་དང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཁོང་དུ་ཆུད་ཅིང་རྟོགས་པར་བྱ་བ་དང་། དེ་དག་ལ་སོགས་པ་ཡོན་ཏན་ཚད་མེད་པའི་ཕྱིར་
en: that they attain the ornament of generosity and the purity of certainty; that they perfect the ornament of discipline and patience; that they purify the attitude of mildness and gentleness; that they understand the purity of diligence; that they understand and comprehend the perfections of concentration and insight; and that they develop limitless other such virtues. Therefore,

source: འདུག་པ་ལས་ལངས་ནསབླ་གོས་ཕྱོགས་གཅིག་ཏུ་བྱས་ཏེ།
en: he stood up, draped his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: With his palms together he bowed toward the Blessed One and said,

source: བཅོམ་ལྡན་འདས་བདག་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་བདེ་བའི་སླད་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སངས་རྒྱས་ཀྱི་གདུང་མི་གཅོད་པར་འགྱུར་བ་དང་། སྤྱོད་ལམ་ཀུན་ཏུ་ཚུལ་ཁྲིམས་ལ་མ་ཆགས་ཤིང་། ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་དང་ལྡན་པ་དང་། ཆོས་ཆེན་པོ་ལ་ནན་ཏན་བྱེད་ཅིང་འཕགས་པའི་ཆོས་ཀྱི་སྤྱོད་ཡུལ་ཚད་མེད་པ་འཛིན་པ་ལ་ཤིན་ཏུ་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སླད་དུ་བདག་ཞུ་བ་ཞུའོ། །
en: “Blessed One, may I inquire, in order to bring benefit and happiness to many people; in order that bodhisattva great beings will not discontinue the Buddha’s lineage; in order that their discipline will be without attachment and pure in all activities; in order that they will apply themselves to the great Dharma; and in order that bodhisattvas will become knowledgeable in upholding the immeasurable domains of the Dharma of noble beings.

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ལ་ཤིན་ཏུ་མཁས་པ་ལགས།
en: Blessed One, how do bodhisattva great beings become knowledgeable concerning the true characteristics of phenomena?

source: ཇི་ལྟར་ན་ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་ཤིན་ཏུ་རྣམ་པར་འབྱེད་པ་ལ་མཁས་པ་ལགས།
en: How do they become skilled in discerning the characteristics of phenomena?

source: ཇི་ལྟར་ན་དྲན་པའི་མཐུ་དང་ལྡན་པ་ལགས།
en: How do they acquire the power of mindfulness?

source: ཇི་ལྟར་ན་ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་གྲངས་རྣམ་པར་འབྱེད་པ་ལ་མཁས་པའི་ཤེས་རབ་དང་ལྡན་པ་ལགས།
en: How do they acquire the insight of knowing how to discern the categories of all phenomena?

source: ཇི་ལྟར་ན་ལུས་འདི་བོར་ནས་ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་རྒྱུན་མི་འཆད་པའི་དྲན་པ་དང་ལྡན་པ་ལགས།
en: Once they have relinquished this body, how do they sustain unbroken mindfulness until they attain unsurpassed and perfect awakening?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་འཛིན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One responded to the bodhisattva Lokadhara,

source: ལེགས་སོ་ལེགས་སོ། །
en: “Excellent, excellent!

source: འཇིག་རྟེན་འཛིན་དེ་ལྟར་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་ལ་དོན་དེ་དག་དྲིས་པ་ནི་ལེགས་སོ། །
en: Lokadhara, it is excellent that you have asked the Thus-Gone One about these subjects on behalf of bodhisattva great beings.

source: ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་བདེ་བའི་ཕྱིར། འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བའི་ཕྱིར། ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ལ་ཕན་པ་དང་བདེ་བའི་དོན་གྱི་ཕྱིར། གཞན་ཡང་ད་ལྟར་གྱི་དུས་དང་། མ་འོངས་པའི་དུས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་ལ་སོགས་པ་ལ་འོད་ཆེན་པོས་སྣང་བར་བྱ་བའི་ཕྱིར་དྲི་བ་དྲིས་པའི་བསོད་ནམས་ནི་དཔག་ཏུ་མེད་དོ། །
en: The merit you have gained from asking questions—in order to bring benefit and happiness to many people, out of love for the world, for the sake of the benefit and happiness of the world and its gods, and to illuminate the bodhisattvas of the present and future with great light—is boundless.

source: ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་དག་དྲིས་པ་ནི་ངེས་པར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཚོམ་ཡོངས་སུ་གཅད་པའི་ཕྱིར། སེམས་ཅན་ཐམས་ཅད་འོད་ཀྱིས་སྣང་བར་བྱ་བ་དང་། བསྲུང་བར་བྱ་བའི་ཕྱིར། སེམས་ཅན་དག་ལ་ཕན་པའི་དོན་བསྟན་པའི་ཕྱིར། སྐྱེ་བོ་དག་གཡང་སའི་ལམ་ལས་བསྒྲལ་བར་བྱ་བའི་ཕྱིར། སྐྱེ་བོ་མང་པོའི་རྟེན་དང་། གནས་དང་། མགོན་དང་། བསྐྱབ་བྱ་བའི་ཕྱིར། ངན་སོང་གསུམ་ལས་གདོན་ཅིང་དབྱུང་བའི་ཕྱིར། སེམས་ཅན་དག་བླ་ན་མེད་པའི་ལམ་ལ་གཟུད་པའི་ཕྱིར། སྐྱེ་བོ་མང་པོ་དག་སྐྱེ་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། སློས་པའི་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། འཁྲུག་པ་ལས་རྣམ་པར་གྲོལ་བའི་ཕྱིར། སེམས་ཅན་ལ་བླ་ན་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་བདེ་བ་སྦྱིན་པའི་ཕྱིར། ཕྱི་མ་མ་འོངས་པའི་དུས་ན་དམ་པའི་ཆོས་བསྲུང་ཞིང་བསྐྱབ་པའི་ཕྱིར། ཕྱི་མ་མ་འོངས་པ་འཇིག་པའི་དུས་ངན་པའི་སེམས་ཅན་དག་བསྒྲལ་བའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་ལ་དྲི་བར་སེམས་པ་ལེགས་སོ། །
en: “As for your having asked the Thus-Gone One about these subjects, it is excellent that you have thought to inquire of the Thus-Gone One in order to eliminate beings’ doubts; illuminate and protect all beings; teach beings beneficial subjects; free beings from treacherous paths; serve as the support, base, protection, and refuge of many beings; extract and remove them from the three lower realms; establish beings on the unsurpassed path; liberate many beings from the anguish of birth, aging, sickness, death, distress, lamentation, pain, and anxiety; bestow the unsurpassed happiness of nirvāṇa upon beings; protect and guard the sublime Dharma in the future; and liberate beings during the dark times of destruction in the future.

source: དེ་ལྟ་བས་ན་འཇིག་རྟེན་འཛིན་ཁྱོད་ལེགས་པར་ཉོན་ལ་རབ་ཏུ་ཡིད་ལ་ཟུང་ཤིག་དང་། རྣམ་པར་ཕྱེ་སྟེ་བཤད་པར་བྱའོ། །
en: Therefore, Lokadhara, listen well and commit this to memory, as I will now explain.”

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་བགྱིའོ་ཞེས་གསོལ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འཇིག་རྟེན་འཛིན་བཅོམ་ལྡན་འདས་ལ་ཕྱིར་ཉན་ཏོ། །
en: The bodhisattva Lokadhara replied, “Blessed One, I shall do as you ask,” and he listened to the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then said,

source: སྐྱེས་བུ་དམ་པ་དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: “Sublime being, I have this to say:

source: ཕན་པའི་དོན་བཞི་མཐོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ལ་བརྩོན་ཞིང་ནན་ཏན་བྱེད་པ་དང་། ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་པར་འགྱུར་རོ། །
en: Bodhisattva great beings who understand four beneficial subjects will endeavor in and apply themselves to the true characteristics of phenomena and become highly skilled in discerning the characteristics of phenomena.

source: བཞི་གང་ཞེ་ན།
en: What are these four?

source: དྲན་པ་ཡོངས་སུ་རྫོགས་པ་ཐོབ་པར་བྱ་བ་དང་། དྲན་པ་རྒྱུན་མི་འཆད་པ་ཐོབ་པར་བྱ་བ་དང་། ཤིན་ཏུ་བྱང་བའི་ཤེས་རབ་ཀྱིས་གོང་ནས་གོང་དུ་འཕར་བ་དང་། རྟག་ཏུ་དྲན་པའི་སེམས་དང་ལྡན་པ་སྟེ།
en: They should achieve perfect mindfulness, achieve unbroken mindfulness, make continuous progress by means of highly refined insight, and always remain mindful.

source: འཇིག་རྟེན་འཛིན་འདི་དག་ནི་དོན་རྣམ་པ་བཞི་མཐོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ལ་བརྩོན་ཞིང་ནན་ཏན་བྱེད་པ་དང་། ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་པ་ཡིན་ནོ། །
en: Lokadhara, bodhisattva great beings who understand these four beneficial subjects will endeavor in and apply themselves to the true characteristics of phenomena and become skilled in discerning the characteristics of phenomena.

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་དོན་བཞི་མཐོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ལ་བརྩོན་ཞིང་ནན་ཏན་བྱེད་པ་དང་། ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་པར་འགྱུར་རོ། །
en: “Lokadhara, bodhisattva great beings who understand an alternate set of four beneficial subjects will endeavor in and apply themselves to the true characteristics of phenomena and become highly skilled in discerning the characteristics of phenomena.

source: ཆོས་རྣམས་ཀྱི་ངེས་པའི་དོན་ལ་ཤིན་ཏུ་ཤེས་པར་བྱ་བ་དང་། ཆོས་རྣམས་ཀྱི་དོན་ཤིན་ཏུ་ཤེས་པར་བྱ་བ་དང་། ཆོས་རྣམས་ཀྱི་རྒྱུ་དང་རྐྱེན་རྣམ་པ་སྣ་ཚོགས་ཤིན་ཏུ་ཤེས་པར་བྱ་བ་དང་། ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་སྒོར་འཇུག་པར་བྱ་བ་དང་བཞིའོ། །
en: They should understand well the definitive meaning of phenomena, understand well the meaning of phenomena, understand well the various causes and conditions of phenomena, and enter the true gateway of phenomena.

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་དོན་རྣམ་པ་བཞི་མཐོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ལ་བརྩོན་ཞིང་ནན་ཏན་བྱེད་པ་དང་། ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་པར་འགྱུར་རོ། །
en: “Lokadhara, bodhisattva great beings who understand an alternate set of four beneficial subjects will endeavor in and apply themselves to the true characteristics of phenomena and become highly skilled in discerning the characteristics of phenomena.

source: ཚད་མེད་པའི་ཆོས་ཀྱི་མཚན་ཉིད་ཤིན་ཏུ་ཤེས་པར་བྱ་བ་དང་། ཚད་མེད་པའི་ངེས་པའི་ཆོས་བསྒོམ་པ་ལ་ཤིན་ཏུ་མཁས་པར་བྱ་བ་དང་། ཚད་མེད་པའི་ཡོན་ཏན་དང་སྤྱོད་པ་འཕེལ་ཞིང་སྐྱེ་བར་བྱ་བ་དང་། ཆོས་རྣམས་ཀྱི་སྐྱེ་བ་དང་འགག་པའི་མཚན་ཉིད་ཤེས་པ་དང་མཐོང་བར་བྱ་བ་དང་བཞིའོ། །
en: They should understand well the characteristics of limitless phenomena, become highly skilled in cultivating limitless definitive phenomena, exponentially increase engagement in limitless virtues, and understand and perceive the characteristic of arising and ceasing of phenomena.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བསྙེན་པར་བྱ་བ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་མྱུར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་། ཆོས་རྣམས་ཀྱི་ཐབས་ལ་ཤིན་ཏུ་མཁས་པས་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པར་བྱ་བ་དང་། ཡེ་ཤེས་དང་ཤེས་རབ་ཐམས་ཅད་ལ་ཤིན་ཏུ་མཁས་པར་བྱ་བའོ། །
en: They should assiduously attend to unsurpassed and perfect awakening, swiftly perfect the factors of awakening, avoid being led astray by others by being highly skilled with regard to the expedient means of phenomena, and become highly skilled in all forms of wisdom and insight.

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་ཆོས་རྣམ་པ་བཞི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ལ་བརྩོན་ཞིང་ནན་ཏན་བྱེད་པ་དང་། ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་པར་འགྱུར་རོ། །
en: “Lokadhara, bodhisattva great beings who possess an alternate set of four qualities will endeavor in and apply themselves to the true characteristics of phenomena and become highly skilled in discerning the characteristics of phenomena.

source: སེམས་ཅན་ལ་ཕན་པ་དང་བདེ་བའི་ཕྱིར་སེམས་ལ་སེར་སྣའི་དྲི་མ་མེད་པ་དང་། རྟག་ཏུ་ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བདེ་བར་གནས་པས་བརྩོན་འགྲུས་སྤྱོད་པ་ལ་བར་ཆད་མེད་པ་དང་། ཡང་དག་པར་ཡིད་ལ་བྱེད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཤིན་ཏུ་ནན་ཏན་བྱེད་པ་དང་བཞིའོ། །
en: Seeking to bring beings benefit and happiness by having a mind that is unstained by stinginess, always keeping pure discipline, being unceasing in their diligent conduct by being steadfast in the perfection of diligence, and applying themselves to the perfection of insight with correct mental engagement.

source: སྨོན་ལམ་ཕུན་སུམ་ཚོགས་པ་ཤིན་ཏུ་དག་པ་དང་ལྡན་པ་དང་། སྤྱོད་པའི་ནན་ཏན་ཕུན་སུམ་ཚོགས་པ་རྣམ་པར་དག་པ་དང་ལྡན་པ་དང་། ཇི་མི་སྙམ་པའི་བཟོད་པའི་ཡོན་ཏན་ལ་བདེ་བར་གནས་པ་དང་། ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་རྣམ་པར་འབྱེད་པའི་འོད་ཟེར་ཐོབ་པ་དང་བཞིའོ། །
en: Having abundant and pure aspirations, having abundant and pure diligent conduct, being steadfast in the virtue of patience that is forgiving, and attaining the understanding that differentiates the true characteristics of phenomena.

source: མོས་པ་ཆེན་པོས་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཚོལ་བ་དང་། བསམ་གཏན་དང་། རྣམ་པར་གྲོལ་བ་དང་། ཏིང་ངེ་འཛིན་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་པས་མོས་པ་ཆེན་པོ་བསྐྱེད་པ་དང་། བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ཆེན་པོའི་སེམས་ཐོབ་པར་བྱ་བའི་ཕྱིར་རྣམ་པར་དག་པའི་སྤྱད་པ་སྤྱོད་པ་ལ་སྦྱོར་བ་དང་། ངེས་པའི་དོན་ལ་ཤིན་ཏུ་ལེགས་པར་བསྒོམ་པ་དང་བཞིའོ། །
en: Pursuing omniscient wisdom with great zeal; generating great zeal by being skilled in discerning concentration, liberation, and absorption; applying themselves to pure conduct in order to attain the mental states of love, compassion, joy, and equanimity; and cultivating the definitive meaning.

source: ཤེས་རབ་ཀྱི་སྤྱོད་ཡུལ་ཕུན་སུམ་ཚོགས་པ་དང་། ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་རྣམ་པར་དག་པ་ཚོལ་ཚོལ་བ་དང་། ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་ལ་མོས་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་སྨོན་ལམ་རྟག་ཏུ་མི་སྤོང་བའོ། །
en: The perfection of the domain of insight, seeking the pure domain of wisdom, zeal for unimpeded wisdom, and never abandoning the aspiration for omniscient wisdom.

source: འཇིག་རྟེན་འཛིན་ཆོས་རྣམ་པ་བཞི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ལ་བརྩོན་ཞིང་ནན་ཏན་བྱེད་པ་དང་། ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་པ་ཡིན་ནོ། །
en: Lokadhara, bodhisattva great beings who have this set of four qualities will endeavor in and apply themselves to the true characteristics of phenomena and become highly skilled in discerning the characteristics of phenomena.”

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་དོན་རྣམ་པ་བཞི་མཐོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དྲན་པའི་མཐུ་ཚོལ་བར་འགྱུར་རོ། །
en: “Lokadhara, bodhisattva great beings who understand an alternate set of four subjects will pursue the power of mindfulness.

source: དྲན་པའི་དབང་པོ་ཡོངས་སུ་རྫོགས་པ་གོམས་པར་བསྒོམ་པར་བྱ་བ་དང་། ཤིན་ཏུ་བདེ་བའི་ཤེས་རབ་སྤྱོད་པ་དང་། དྲན་པ་རྒྱུན་མི་འཆད་པ་དང་ལྡན་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་རྫོགས་པར་བསྒོམ་པ་དང་བཞིའོ། །
en: Cultivating familiarity with the complete power of mindfulness, experiencing blissful insight, maintaining unbroken mindfulness, and thoroughly cultivating the four applications of mindfulness.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྫོགས་པར་བྱ་བའི་ཕྱིར་རྟག་ཏུ་དྲན་པ་སེམས་ལ་འཇོག་པ་དང་། དྲན་པའི་དབང་པོ་རྣོ་བས་སྔོན་གྱི་གནས་བསྒོམ་པ་ཤེས་པའི་ཤེས་རབ་རྣམ་པར་དག་པ་དང་ལྡན་པ་དང་། དྲན་པ་རྒྱུན་མི་འཆད་པར་མྱུར་དུ་འཐོབ་པར་བྱ་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་རྒྱུ་བསྐྱེད་པ་དང་བཞིའོ། །
en: Always applying mindfulness with respect to the mind in order to perfect the factors of awakening, having pure insight that employs an acute power of mindfulness to know what was cultivated in previous existences, swiftly attaining unbroken mindfulness, and generating the cause of omniscient wisdom.

source: འཇིག་རྟེན་འཛིན་དོན་རྣམ་པ་བཞི་མཐོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དྲན་པའི་མཐུ་ཚོལ་བར་འགྱུར་རོ། །
en: “Lokadhara, bodhisattva great beings who understand four subjects will pursue the power of mindfulness.

source: བསམ་པའི་ཐབས་ཡོངས་སུ་རྫོགས་པ་བསྒོམ་པ་དང་། ཡང་དག་པའི་ཡེ་ཤེས་དང་ཤེས་རབ་བསྒོམ་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐོབ་པར་བྱ་བའི་ཕྱིར་ཤིན་ཏུ་བརྩོན་འགྲུས་བསྐྱེད་པ་དང་། དྲན་པའི་སྟོབས་རྒྱུན་མི་འཆད་པ་ཐོབ་པར་བྱ་བའི་ཕྱིར་དྲན་པ་མི་བརྗེད་པའོ། །
en: Cultivating the entirety of contemplative methods, cultivating genuine wisdom and insight, generating tremendous diligence in order to attain the qualities of buddhahood, and not forgetting mindfulness in order to attain the strength of unbroken mindfulness.

source: འཇིག་རྟེན་འཛིན་འདི་དག་ནི་དོན་རྣམ་པ་བཞི་མཐོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དྲན་པའི་མཐུ་ཚོལ་བ་ཡིན་ནོ། །
en: Lokadhara, bodhisattva great beings who understand these four subjects will pursue the power of mindfulness.”

source: འཇིག་རྟེན་འཛིན་ཆོས་རྣམ་པ་བཞི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དྲན་པའི་མཐུ་ཐོབ་པར་འགྱུར་རོ། །
en: “Lokadhara, bodhisattva great beings who have four qualities will attain the power of mindfulness.

source: ཤེས་རབ་ཤིན་ཏུ་བྱང་བ་དྲན་པའི་ཕྱིར་རྟག་ཏུ་རྒྱུན་མི་འཆད་པའི་བརྩོན་འགྲུས་དང་། ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ཐོབ་པར་བྱ་བའི་ཕྱིར་རྩེ་གཅིག་པའི་སེམས་ཀྱིས་རྟག་ཏུ་རྒྱུན་མི་འཆད་པ་དང་། ཆོས་ཐམས་ཅད་ཡང་དག་པར་དྲན་པར་བྱ་བའི་ཕྱིར་རྟག་ཏུ་ལེ་ལོ་མེད་པ་དང་། ཡང་དག་པའི་ཡིད་ལ་བྱ་བའི་ཕྱིར་རྟག་ཏུ་དབང་པོ་རྣམས་སྲུང་བ་དང་བཞིའོ། །
en: Constant and unbroken diligence aimed at recollecting the highest insight, constant and unbroken focus aimed at achieving the true characteristics of phenomena, constant vigilance aimed at accurately recalling all phenomena, and constant guarding of one’s faculties in order to obtain correct mental engagement.

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་ཆོས་རྣམ་པ་བཞི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དྲན་པའི་མཐུ་ཐོབ་པར་འགྱུར་རོ། །
en: “Lokadhara, bodhisattva great beings who have an alternate set of four qualities will attain the power of mindfulness.

source: ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་ལ་གནས་པ་དང་། སྤྱོད་ལམ་རྣམ་པར་དག་པ་དང་ལྡན་པ་དང་། སྤྱོད་པའི་གནས་ཀུན་ཏུ་སེམས་ཀྱི་སྒྲིབ་པ་ལྔ་ཡོངས་སུ་བསལ་ཏེ་འཇིག་རྟེན་གྱི་ཆོས་ལ་མི་ཆགས་པ་དང་། ལས་ཀྱི་སྒྲིབ་པ་དང་ཉོན་མོངས་པའི་སྒྲིབ་པ་ཡོངས་སུ་སྤངས་པ་དང་བཞིའོ། །
en: Maintaining pure discipline, having pure conduct, dispelling the five mental obscurations concerning all forms of conduct while being unattached to worldly phenomena, and discarding the obscurations of action and affliction.

source: མི་འཁྲུགས་པའི་སེམས་ཀྱིས་དགེ་བའི་ཆོས་ཚོལ་བ་དང་། སེམས་ཀྱི་མཚན་ཉིད་གཅིག་ལ་གོམས་པར་བསྒོམས་པ་དང་། ཆོས་རྣམས་ཀྱི་རྣམ་གྲངས་ལ་ཡང་དག་པར་འཇུག་ཅིང་ཤིན་ཏུ་མཁས་པ་དང་། འདུ་འཛི་ལ་མི་མོས་པས་ཁྱིམ་ན་གནས་པ་དང་རབ་ཏུ་བྱུང་བའི་གང་ཟག་སྤོང་བ་དང་བཞིའོ། །
en: Pursuing virtuous phenomena with an unperturbed mind, cultivating familiarity with the mind’s sole characteristic, having understanding and knowledge of Dharma discourses, and avoiding both householders and renunciates by being uninterested in socializing.

source: དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་པ་དང་། རྟག་ཏུ་ཆོས་ཟབ་མོ་ལ་ནན་ཏན་བྱེད་པ་དང་། རྟག་ཏུ་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའི་གན་དུ་འགྲོ་བ་ལ་དགའ་བ་དང་། གསོལ་བ་དང་ཞུ་བ་ལ་དགའ་ཞིང་ཤེས་རབ་བསྒོམ་པ་ལ་མོས་པའོ། །
en: Training under a spiritual friend, constantly applying oneself to the profound Dharma, always being happy to approach buddhas and bodhisattvas, and delighting in supplication and inquiry while being inspired to cultivate insight.

source: འདི་དག་ནི་ཆོས་རྣམ་པ་འདི་བཞི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དྲན་པའི་མཐུ་ཐོབ་པ་ཡིན་ནོ། །
en: Bodhisattva great beings who have these four qualities will attain the power of mindfulness.”

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་ཆོས་རྣམ་པ་བཞི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་གྲངས་རྣམ་པར་འབྱེད་པ་ལ་མཁས་ཤིང་ཤེས་རབ་ལ་ནན་ཏན་བྱེད་པར་འགྱུར་རོ། །
en: “Lokadhara, bodhisattva great beings who have an alternate set of four qualities will progress toward insight by knowing how to discern the categories of all phenomena.

source: ཆོས་ཐམས་ཅད་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ལ་ཤིན་ཏུ་མཁས་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རྒྱུར་གྱུར་པ་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ངེས་པའི་དོན་ལ་མཁས་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་སྨྲ་བ་དང་ཚིག་གི་རྣམ་གྲངས་ལ་མཁས་པ་དང་བཞིའོ། །
en: Being very knowledgeable with regard to the true characteristics of all phenomena, being very knowledgeable with regard to discerning the causes of all phenomena, being knowledgeable with regard to the definitive meaning of all phenomena, and being knowledgeable with regard to the classifications of words and speech related to all phenomena.

source: ཆོས་རྣམས་ཀྱི་ཇི་ལྟ་བའི་གོ་རིམས་ལ་མཁས་པ་དང་། ཆོས་ཐམས་ཅད་རྟེན་ཅིང་འབྲེལ་ཏེ་འབྱུང་བའི་ཐབས་ལ་མཁས་པ་དང་། ཆོས་ཐམས་ཅད་ནན་ཏན་བྱ་བའི་ཐབས་དང་ལྡན་པ་དང་། ངེས་པའི་དོན་དང་བཀྲི་བའི་དོན་གྱི་མདོ་སྡེ་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་པ་དང་བཞིའོ། །
en: Being knowledgeable with regard to the progressive order of Dharma teachings, being knowledgeable with regard to the means of the dependent origination of all phenomena, having the skillful means to cultivate all Dharma teachings, and being very knowledgeable with regard to discerning both the discourses on the definitive meaning and those on the inferred meaning.

source: ལམ་དང་ལམ་མ་ཡིན་པའི་ཤེས་པ་ཤིན་ཏུ་སློབ་པ་ལ་མཁས་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་དོན་ལ་བཤད་པའི་དབང་པོ་ཐོབ་པ་དང་། མྱུར་དུ་རྣམ་པར་དག་པའི་ཤེས་རབ་ཀྱི་སྤྱོད་ཡུལ་ཐོབ་པ་དང་། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྫོགས་པར་སྒོམ་པའོ། །
en: Being knowledgeable with regard to distinguishing the path from what is not the path, being able to describe the meaning of any Dharma teaching, swiftly achieving the domain of pure insight, and perfectly cultivating the perfection of wisdom.

source: འཇིག་རྟེན་འཛིན་འདི་དག་ནི་ཆོས་རྣམ་པ་བཞི་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་གྲངས་རྣམ་པར་འབྱེད་པ་ལ་མཁས་ཤིང་ཤེས་རབ་ལ་ནན་ཏན་བྱེད་པ་ཡིན་ནོ། །
en: Lokadhara, bodhisattva great beings who have this alternate set of four qualities will progress toward insight by knowing how to discern the categories of all phenomena.

source: ཀུན་འབྱུང་གི་མཚན་ཉིད་ཀྱི་ཆོས་ཐམས་ཅད་སྒོམ་པ་ལ་མཁས་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རྒྱུ་འགོག་པའི་མཚན་ཉིད་ལ་ཤིན་ཏུ་མཁས་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རྐྱེན་གྱི་མཚན་ཉིད་ལ་ཤིན་ཏུ་མཁས་པ་དང་། རྒྱུ་དང་རྐྱེན་གྱིས་ཐབས་ལ་འཇུག་པ་དང་བཞིའོ། །
en: Being knowledgeable about cultivating all phenomena characterized by origination, being knowledgeable with regard to the characteristic of cessation related to the causes of all phenomena, being knowledgeable about the characteristic of the conditions related to all phenomena, and being skillful by means of causes and conditions.

source: སྡུག་བསྔལ་བའི་ཆོས་ཐམས་ཅད་ལ་ཤིན་ཏུ་མཁས་པ་དང་། ཀུན་འབྱུང་གི་ཆོས་ཐམས་ཅད་ལ་ཤིན་ཏུ་མཁས་པ་དང་། འགོག་པའི་ཆོས་ཐམས་ཅད་ལ་ཤིན་ཏུ་མཁས་པ་དང་། འགོག་པ་དང་ལམ་གྱི་ཆོས་ཐམས་ཅད་ལ་ཤིན་ཏུ་མཁས་པ་དང་བཞིའོ། །
en: Being knowledgeable with regard to all the phenomena of suffering, being knowledgeable with regard to all the phenomena of origination, being knowledgeable with regard to all the phenomena of cessation, and being knowledgeable with regard to all the phenomena of cessation and the path.

source: ཆོས་རྣམས་འདུ་བ་དང་འཇིག་པའི་སྦྱོར་བ་ལ་མཁས་པ་དང་། སྔོན་གྱི་རྒྱུས་མཐུ་ཐོབ་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ཅི་དང་ཅིས་འདུལ་བ་ལ་ཤིན་ཏུ་མཁས་པ་དང་། ཡི་གེ་དང་། འབྲུ་དང་། ཚིག་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་པ་དང་བཞིའོ། །
en: Being knowledgeable with regard to the connection between the formation and destruction of all phenomena; drawing on previous causes to achieve power; being knowledgeable with regard to anything that tames phenomena; and being knowledgeable with regard to discerning letters, syllables, and words.

source: བཀྲི་བའི་དོན་གྱི་མདོ་སྡེ་ལ་ཤིན་ཏུ་མཁས་པ་དང་། ངེས་པའི་དོན་གྱི་མདོ་སྡེའི་ཚིག་གི་རྗེས་སུ་མི་འབྲང་བ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་ཀྱི་རྒྱུ་ལ་ཤིན་ཏུ་མཁས་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་མཚན་མ་མེད་པའི་ཡེ་ཤེས་ལ་བདེ་བར་གནས་པ་སྟེ།
en: Being very knowledgeable with regard to the discourses of inferred meaning, not becoming caught up in the words of the discourses of definitive meaning, being knowledgeable with regard to the seal of the characteristics of all phenomena, and being steadfast in the wisdom of the absence of marks of all phenomena.
